PerfTest/Test 1/statistics.json
{
  "HomePage" : {
    "transaction" : "HomePage",
    "sampleCount" : 3466,
    "errorCount" : 1365,
    "errorPct" : 39.382572,
    "meanResTime" : 28600.952106174238,
    "minResTime" : 791.0,
    "maxResTime" : 74915.0,
    "pct1ResTime" : 46878.200000000004,
    "pct2ResTime" : 54975.99999999998,
    "pct3ResTime" : 72833.65,
    "throughput" : 35.93050257090728,
    "receivedKBytesPerSec" : 1342.6223428396863,
    "sentKBytesPerSec" : 7.614543216899569
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 3466,
    "errorCount" : 1365,
    "errorPct" : 39.382572,
    "meanResTime" : 28600.952106174238,
    "minResTime" : 791.0,
    "maxResTime" : 74915.0,
    "pct1ResTime" : 46878.200000000004,
    "pct2ResTime" : 54975.99999999998,
    "pct3ResTime" : 72833.65,
    "throughput" : 35.93050257090728,
    "receivedKBytesPerSec" : 1342.6223428396863,
    "sentKBytesPerSec" : 7.614543216899569
  }
}